[
  {
    "id": 1,
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Instagram is a global photo and video-sharing platform that allows users to capture, edit, and share moments from their daily lives. With features like Stories, Reels, and IGTV, users can express creativity through short videos and stunning visuals. Businesses and creators use Instagram to connect with audiences, build brands, and promote content. The platform emphasizes engagement through likes, comments, and messaging, fostering a vibrant community where users can discover trends, influencers, and inspiration across the world.",
    "size": 85,
    "reviews": "4.3M",
    "ratingAvg": 4.5,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 890000 }
    ]
  },
  {
    "id": 2,
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "WhatsApp is a secure messaging app that allows users to communicate through text, voice, and video calls worldwide. It supports multimedia sharing including photos, videos, documents, and voice notes. End-to-end encryption ensures conversations remain private and secure. WhatsApp also offers group chats, status updates, and business profiles for organizations to connect with customers effectively. With billions of active users, it remains one of the most reliable and convenient communication platforms globally.",
    "size": 60,
    "reviews": "3.8M",
    "ratingAvg": 4.7,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 950000 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/BHbGXtRn/Facebook-Logo-2019.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "description": "Facebook is a global social networking platform that connects people, communities, and businesses. It allows users to share updates, photos, videos, and events with friends and followers. With integrated groups, pages, and marketplace, Facebook enables individuals and organizations to engage and grow audiences. The platform also supports live streaming, reels, and advertisements, making it a versatile space for entertainment, connection, and digital marketing. Facebook continues to evolve as a central hub for online social interaction.",
    "size": 95,
    "reviews": "5M",
    "ratingAvg": 4.2,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 60000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "id": 4,
    "image": "https://sf-static.tiktokcdn.com/obj/eden-sg/uhtyvueh7nulogpoguhm/tiktok-icon2.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "TikTok is a short-form video platform where users create and share creative, entertaining, and educational videos. It empowers creators with powerful editing tools, effects, and trending soundtracks. The app’s algorithm curates personalized content feeds, keeping users engaged with videos that match their interests. TikTok has become a global cultural phenomenon, inspiring trends, challenges, and viral moments that shape modern internet culture. It is especially popular among younger audiences and digital creators worldwide.",
    "size": 120,
    "reviews": "6M",
    "ratingAvg": 4.4,
    "downloads": "3B+",
    "ratings": [
      { "name": "1 star", "count": 70000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 180000 },
      { "name": "4 star", "count": 420000 },
      { "name": "5 star", "count": 1600000 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co.com/6RnPfBcB/You-Tube-LOGO.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is the world’s largest video-sharing platform, enabling users to upload, view, and interact with videos across every imaginable category. From music and tutorials to entertainment and news, YouTube empowers creators to reach global audiences and monetize their content. With personalized recommendations, live streaming, and YouTube Shorts, it provides a dynamic experience for users and creators alike. It has become a cornerstone of online entertainment, education, and expression in the digital era.",
    "size": 110,
    "reviews": "8M",
    "ratingAvg": 4.6,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 90000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "id": 6,
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Telegram_logo.svg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "description": "Telegram is a cloud-based messaging app known for its speed, security, and privacy. It offers group chats, channels, and bots, allowing users to communicate efficiently at scale. Telegram supports file sharing, voice calls, video messages, and secret chats with end-to-end encryption. Its lightweight design and cross-platform accessibility make it popular among users who value privacy and reliability. Telegram also empowers communities and organizations to broadcast messages to millions seamlessly.",
    "size": 75,
    "reviews": "2.5M",
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 220000 },
      { "name": "5 star", "count": 750000 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co.com/dwFxvBhs/OIP.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a multimedia messaging app that allows users to send photos and videos that disappear after viewing. With creative filters, lenses, and bitmoji avatars, Snapchat emphasizes fun and spontaneity. The app also offers stories, spotlight videos, and Snap Map for real-time location sharing. It remains a favorite among younger users for its engaging features and privacy-focused design, promoting authentic and in-the-moment communication between friends.",
    "size": 70,
    "reviews": "2.9M",
    "ratingAvg": 4.2,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 620000 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co.com/WvMHP8KD/t-500x300.jpg",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "description": "X, formerly known as Twitter, is a real-time social networking platform where users share short posts called tweets. It is widely used for news, discussions, and live event updates. X connects individuals, businesses, and influencers, fostering conversations around trending topics worldwide. With features like Spaces, Communities, and premium subscriptions, X continues to evolve into a comprehensive platform for media, communication, and content creation.",
    "size": 80,
    "reviews": "3.4M",
    "ratingAvg": 4.1,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 35000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 720000 }
    ]
  },
  {
    "id": 9,
    "image": "https://upload.wikimedia.org/wikipedia/commons/2/26/Spotify_logo_with_text.svg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "description": "Spotify is a leading music streaming platform that provides access to millions of songs, podcasts, and playlists from around the world. Users can create personalized playlists, follow artists, and explore new music tailored to their taste. Spotify offers both free and premium plans with offline listening and ad-free experiences. It supports smart recommendations powered by advanced AI and has revolutionized the way people enjoy and discover music globally.",
    "size": 85,
    "reviews": "3.2M",
    "ratingAvg": 4.7,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 950000 }
    ]
  },
  {
    "id": 10,
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Netflix_2015_logo.svg",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is a subscription-based streaming platform offering a vast library of movies, TV shows, documentaries, and original productions. It delivers high-quality entertainment across genres, allowing users to watch on-demand content anytime and anywhere. Netflix’s recommendation system curates personalized viewing experiences, making it the go-to destination for binge-watchers. With offline downloads, multiple profiles, and global accessibility, Netflix redefined the future of digital entertainment.",
    "size": 90,
    "reviews": "4M",
    "ratingAvg": 4.6,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 280000 },
      { "name": "5 star", "count": 950000 }
    ]
  },
  {
    "id": 11,
    "image": "https://upload.wikimedia.org/wikipedia/commons/b/be/Facebook_Messenger_logo_2020.svg",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "Messenger is Meta’s official instant messaging platform that enables users to chat, share media, and make voice or video calls. Integrated with Facebook, it also supports standalone use and cross-platform conversations. Messenger offers group chats, reactions, and real-time communication tools, making it perfect for staying connected with friends and family. With added encryption and multi-device sync, it’s both secure and user-friendly.",
    "size": 65,
    "reviews": "2.7M",
    "ratingAvg": 4.4,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 35000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 820000 }
    ]
  },
  {
    "id": 12,
    "image": "https://upload.wikimedia.org/wikipedia/commons/c/ca/LinkedIn_logo_initials.png",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "description": "LinkedIn is a professional networking platform designed for career growth, job opportunities, and business connections. Users can showcase resumes, skills, and experiences while engaging with industry professionals. It provides a space for employers to recruit talent and for individuals to build professional visibility. With LinkedIn Learning, the app also promotes continuous education and skill development for modern careers.",
    "size": 70,
    "reviews": "2.1M",
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 60000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 600000 }
    ]
  },
  {
    "id": 13,
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Pinterest-logo.png",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "description": "Pinterest is a visual discovery platform where users find and save creative ideas, inspirations, and projects. From home decor and fashion to recipes and travel, it helps people plan and organize their passions. With Pins, Boards, and shopping integrations, Pinterest connects creativity with practicality. It’s a go-to platform for inspiration seekers and brands looking to engage visually with global audiences.",
    "size": 55,
    "reviews": "1.9M",
    "ratingAvg": 4.6,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 12000 },
      { "name": "2 star", "count": 25000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 160000 },
      { "name": "5 star", "count": 720000 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co.com/v6V2J4BZ/reddit-logo-reddit-icon-transparent-free-png.png",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "description": "Reddit is a community-driven discussion platform that hosts millions of user-created forums called subreddits. It’s a space for people to share news, memes, stories, and opinions on virtually any topic. Reddit fosters open discussion, voting-based ranking, and real-time engagement. Whether it’s entertainment, technology, or personal advice, Reddit provides a diverse space for users to learn, laugh, and connect with like-minded people.",
    "size": 80,
    "reviews": "2.3M",
    "ratingAvg": 4.4,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 800000 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co.com/Q3J97xcL/OIP.jpg",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "description": "Zoom is a leading video conferencing platform that enables users to host online meetings, webinars, and virtual events. It supports HD video, screen sharing, and cloud recording with a simple, user-friendly interface. Widely used for education, business, and remote collaboration, Zoom connects millions globally. Its breakout rooms, chat features, and reliability make it an essential tool for modern communication.",
    "size": 95,
    "reviews": "3.1M",
    "ratingAvg": 4.6,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 220000 },
      { "name": "5 star", "count": 950000 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co.com/fYK1mth4/OIP.jpg",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "description": "Discord is a communication platform designed for communities, gamers, and teams to interact via text, voice, and video channels. It offers servers, private messaging, and integrations with other apps and services. Users can join communities, share media, host events, and stream content directly. Discord’s focus on real-time communication, customizable channels, and privacy features has made it a popular hub for online collaboration and entertainment, connecting millions globally.",
    "size": 75,
    "reviews": "2.2M",
    "ratingAvg": 4.6,
    "downloads": "300M+",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 35000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 650000 }
    ]
  }
]
